<h3>Introduction</h3><p style="text-align: justify;">Internet, Web et applications web sont des mots que nous entendons tous les jours mais qui sont pourtant sujets &agrave; de nombreuses confusions. Il semble primordial d&rsquo;en donner une d&eacute;finition pr&eacute;cise.</p><p style="text-align: justify;">Internet est un r&eacute;seau de r&eacute;seaux &agrave; l&rsquo;&eacute;chelle mondiale. Il permet l&rsquo;&eacute;change de paquets &agrave; travers ce r&eacute;seau. Le Web n&rsquo;est qu&rsquo;une application d&rsquo;Internet et permet de consulter des pages accessibles sur des sites &agrave; l&rsquo;aide d&rsquo;un navigateur. Enfin, les applications web sont des applications h&eacute;berg&eacute;es par des serveurs et accessibles par des navigateurs web. Ces applications sont nombreuses et vari&eacute;es : r&eacute;seaux sociaux, webmail, sites de e-commerce, jeux. Il convient donc de s&eacute;curiser le Web qui contient des donn&eacute;es sensibles, confidentielles ou personnelles.</p><p style="text-align: justify;">De nombreux acteurs aident &agrave; se pr&eacute;munir contre les attaques des hackers. En France, l&rsquo;ANSSI qui s&rsquo;occupe de la s&eacute;curit&eacute; des syst&egrave;mes d&rsquo;information met &agrave; disposition des guides sur les bonnes pratiques pour la s&eacute;curit&eacute; des syst&egrave;mes informatiques. Aux Etats-Unis, l&rsquo;OWASP est une communaut&eacute; de b&eacute;n&eacute;voles d&eacute;di&eacute;e &agrave; la s&eacute;curit&eacute; des applications web. Elle publie des articles, guides et logiciels pour sensibiliser aux risques li&eacute;s &agrave; la s&eacute;curit&eacute; web. De m&ecirc;me, le WASC qui rassemble des experts en s&eacute;curit&eacute;, publie des documents sur la s&eacute;curit&eacute; web.</p><p style="text-align: justify;"><br></p><h4>Architecture d&rsquo;internet et fonctionnement du Web</h4><p style="text-align: justify;">Le Web repose sur le r&eacute;seau internet, il convient donc d&rsquo;en d&eacute;crire bri&egrave;vement le fonctionnement. Internet est construit en diff&eacute;rentes couches. Le mod&egrave;le majoritairement utilis&eacute; est le couple TCP/IP qui fonctionne en quatre couches : la couche acc&egrave;s r&eacute;seau, la couche internet, la couche transport et la couche applicative.</p><p style="text-align: justify;">Le Web utilise toutes ces couches pour ses &eacute;changes de donn&eacute;es. Ce qui distingue les diff&eacute;rents services d&rsquo;Internet est le protocole utilis&eacute; par la couche applicative. Par exemple, pour &eacute;changer des mails le protocole SMTP est utilis&eacute;. Le Web fonctionne gr&acirc;ce au protocole HTTP.</p><p style="text-align: justify;">Le protocole HTTP a &eacute;t&eacute; d&eacute;velopp&eacute; pour le Web et a permis son d&eacute;veloppement. C&rsquo;est un protocole de messages : l&rsquo;utilisateur envoie une requ&ecirc;te par son navigateur web et la requ&ecirc;te est trait&eacute;e par le serveur qui renvoie une r&eacute;ponse au client.</p><p align="center"><img src="/images/introduction1.jpg" alt="coucou" style="width: 50%;" class="fr-fic fr-dii"><br><br>Figure 1 : Sch&eacute;ma basique du fonctionnement du protocole http</p><p style="text-align: justify;">Le Web a &eacute;t&eacute; cr&eacute;&eacute; en 1989 et a connu une &eacute;volution importante.</p><p style="text-align: justify;"><br></p><h4>L&rsquo;&eacute;volution du Web : du Web 1.0 au Web 3.0</h4><h5>Web 1.0 (1990-2000) : le Web statique</h5><p style="text-align: justify;">Dans les ann&eacute;es 90, le Web avait pour vocation d&rsquo;afficher uniquement du contenu aux utilisateurs, c&rsquo;est pourquoi on parle de Web statique. Les sites web pouvaient &ecirc;tre vus comme des magazines. Ils &eacute;taient limit&eacute;s &agrave; des liens hypertextes et &agrave; du contenu multim&eacute;dia.</p><p style="text-align: justify;"><br></p><h5>Web 2.0 (2000-2010) : le Web participatif ax&eacute; sur les utilisateurs</h5><p style="text-align: justify;">A partir des ann&eacute;es 2000, le comportement des utilisateurs a chang&eacute; et le Web est devenu collaboratif. L&rsquo;internaute ne consulte plus uniquement, il peut maintenant publier du contenu et est sollicit&eacute; &agrave; le faire. Le Web 2.0 voit appara&icirc;tre de multiples r&eacute;seaux sociaux ou blog comme Facebook et YouTube.</p><p style="text-align: justify;"><br></p><h5>Web 3.0 (2010-20xx) : le Web s&eacute;mantique ou le Web de l&rsquo;Internet des objets</h5><p style="text-align: justify;">Avec la multiplication des t&eacute;l&eacute;phones mobiles, tablettes et objets connect&eacute;s, le Web a d&ucirc; &eacute;voluer pour se connecter au monde r&eacute;el des utilisateurs. Les maisons connect&eacute;es sont un tr&egrave;s bon exemple, le chauffage peut alors s&rsquo;adapter &agrave; la m&eacute;t&eacute;o. Ce Web est &eacute;galement centr&eacute; sur l&rsquo;utilisateur, ce n&rsquo;est plus l&rsquo;utilisateur qui agr&egrave;ge les donn&eacute;es mais des suggestions viennent &agrave; lui bas&eacute;es sur son historique ou ses donn&eacute;es personnelles. Cette &eacute;volution implique une &eacute;volution des technologies et de potentielles incompatibilit&eacute;s entre elles. Pour guider les diff&eacute;rentes technologies du Web dans une m&ecirc;me direction, le W3C pour World Wide Web Consortium est une communaut&eacute; internationale qui s&rsquo;occupe de d&eacute;velopper les normes du Web.</p><p style="text-align: justify;"><br></p><h4>Pourquoi s&eacute;curiser son site web ?</h4><p style="text-align: justify;">Le Web n&rsquo;est plus uniquement utilis&eacute; pour afficher du contenu statique aux utilisateurs. Il pr&eacute;sente diff&eacute;rentes applications : moteurs de recherche, webmail qui permet de g&eacute;rer ses mails par une interface web, le commerce &eacute;lectronique et les jeux en ligne, les r&eacute;seaux sociaux. Toutes ces applications peuvent &ecirc;tre sujettes &agrave; des actes de piratage.</p><p style="text-align: justify;">Il n&rsquo;est pas rare de voir dans les actualit&eacute;s des cas de piratage informatique. Par exemple en 2016, le site de e-commerce d&rsquo;Acer a &eacute;t&eacute; victime d&rsquo;une attaque de hackers qui ont r&eacute;ussi &agrave; d&eacute;rober les informations personnelles de 34 500 clients incluant leurs coordonn&eacute;es bancaires. En 2017, Anonymous a satur&eacute; le site de la Cour Constitutionnelle espagnole pour montrer leur soutien quant &agrave; l&rsquo;ind&eacute;pendance de la Catalogne. Des attaques ont aussi &eacute;t&eacute; men&eacute;es sur le site de la police espagnole. Ces exemples montrent que les attaques web sont utilis&eacute;es pour diff&eacute;rentes fins et ne sont pas rares. La s&eacute;curisation des sites web est donc un enjeu majeur.</p>