<h4>La s&eacute;curit&eacute; web</h4><p style="text-align: justify;">La s&eacute;curit&eacute; web est la pratique de prot&eacute;ger les sites web contre l&#39;acc&egrave;s, l&#39;utilisation, la modification, la destruction ou la perturbation non autoris&eacute;s. La s&eacute;curit&eacute; ne s&rsquo;arr&ecirc;te pas &agrave; la pr&eacute;vention mais aussi &agrave; la r&eacute;action de la victime en cas d&rsquo;attaque.</p><h4>1.Pr&eacute;vention</h4><p style="text-align: justify;">De nombreux acteurs comme l&rsquo;OWASP ou l&rsquo;ANSSI ont r&eacute;dig&eacute; des documents pour pr&eacute;venir les attaques web. Ces pr&eacute;ventions se font au niveau du d&eacute;veloppement et du syst&egrave;me h&eacute;bergeant le service.</p><h5>D&eacute;veloppement</h5><p style="text-align: justify;">L&rsquo;OWASP a dress&eacute; une liste des bonnes pratiques de d&eacute;veloppement rassembl&eacute;es dans un livret de 17 pages. Ce guide doit permettre aux d&eacute;veloppeurs de produire du code qui n&rsquo;est pas vuln&eacute;rable aux attaques les plus courantes. L&rsquo;ANSSI a &eacute;galement r&eacute;dig&eacute; une note technique de bonnes pratiques de d&eacute;veloppement. Ce document est plus complet que celui de l&rsquo;OWASP dans le sens o&ugrave; il couvre &agrave; la fois la pr&eacute;vention pour la s&eacute;curit&eacute; web mais aussi les bons r&eacute;flexes &agrave; avoir en cas d&rsquo;attaques.</p><h5>Tests</h5><p style="text-align: justify;">Tout d&eacute;veloppement se fait en parall&egrave;le avec des tests. Encore faut-il savoir quoi, pourquoi, comment, quand et o&ugrave; tester les applications web. L&rsquo;OWASP a r&eacute;dig&eacute; un guide de tests qui permet de r&eacute;pondre &agrave; ces questions. Ce guide propose m&ecirc;me une structure compl&egrave;te de tests pour que le lecteur puisse cr&eacute;er son propre programme de tests. L&rsquo;objectif de ce document est de guider le lecteur dans ses choix de techniques de tests afin de produire des applications web fiables et s&eacute;curis&eacute;es.</p><h5>Infrastructure</h5><p style="text-align: justify;">Un travail est aussi &agrave; faire au niveau de l&rsquo;architecture et de la configuration du syst&egrave;me qui h&eacute;berge le service. La note technique de l&rsquo;ANSSI traite de ce sujet en expliquant les principes de base &agrave; suivre.</p><h5>Scanners et logiciels pr&eacute;ventifs</h5><p style="text-align: justify;">Un grand nombre de logiciels de scan de sites web sont disponibles. Ces logiciels permettent de d&eacute;tecter les vuln&eacute;rabilit&eacute;s des applications web. Le WASC a r&eacute;dig&eacute; un guide, le WASSEC, pour &eacute;valuer les scanners d&rsquo;application web en fonction de leur efficacit&eacute; &agrave; tester les applications web et &agrave; trouver leur vuln&eacute;rabilit&eacute;. Le lecteur peut alors &eacute;valuer les diff&eacute;rents scans propos&eacute;s en fonction des crit&egrave;res du guide pour choisir le scanner qui r&eacute;pond le mieux &agrave; ses attentes.</p><p style="text-align: justify;">Le WASC a &eacute;galement list&eacute; les scans payants et gratuits les plus utilis&eacute;s. Plusieurs logiciels de l&rsquo;OWASP y figurent. L&rsquo;un des plus connus est le logiciel ZAP pour Zed Attack Proxy qui automatise la d&eacute;tection des failles et propose de nombreuses fonctionnalit&eacute;s telles que l&rsquo;interception d&rsquo;un serveur proxy, le scan actif ou passif d&rsquo;un site web.</p><p style="text-align: justify;">D&rsquo;autres logiciels, qui ne sont pas des scanners, permettent aussi de faire de la pr&eacute;vention contre des attaques web. Webscarab par exemple, d&eacute;velopp&eacute; par l&rsquo;OWASP, agit comme un serveur proxy et permet de modifier les requ&ecirc;tes HTTP avant qu&rsquo;elles ne soient envoy&eacute;es au serveur.</p><h5>Audits de s&eacute;curit&eacute;</h5><p style="text-align: justify;">Un audit de s&eacute;curit&eacute; informatique est une expertise qui permet de relever les failles d&rsquo;un syst&egrave;me informatique. Un plan d&rsquo;action pour contrer ces failles est ensuite &eacute;tabli. Des soci&eacute;t&eacute;s comme Vaadata ou le groupe GTS proposent de r&eacute;aliser des audits de s&eacute;curit&eacute; d&rsquo;application web. Les tests d&rsquo;intrusion sont la m&eacute;thode la plus utilis&eacute;e pour r&eacute;aliser des audits de s&eacute;curit&eacute; des applications web.</p><p style="text-align: justify;">Ils sont class&eacute;s en trois cat&eacute;gories :</p><ul><li>Bo&icirc;te noire : Les tests d&rsquo;intrusion sont effectu&eacute;s en conditions r&eacute;elles. L&rsquo;auditeur r&eacute;alise les tests de l&rsquo;ext&eacute;rieur et ne poss&egrave;de pas d&rsquo;informations suppl&eacute;mentaires sur le syst&egrave;me test&eacute;.</li><li>Bo&icirc;te grise : L&rsquo;auditeur poss&egrave;de quelques informations sur le syst&egrave;me, g&eacute;n&eacute;ralement un compte utilisateur lui est donn&eacute;.</li><li>Bo&icirc;te blanche : Les r&eacute;glages mis en place sont connus par l&rsquo;auditeur.</li></ul><p style="text-align: justify;">La deuxi&egrave;me &eacute;tape des tests d&rsquo;intrusion consiste &agrave; essayer d&rsquo;utiliser les failles d&eacute;couvertes pour compromettre le syst&egrave;me. Cette phase est appel&eacute;e &laquo; l&rsquo;exploit &raquo;. On retrouve aussi l&rsquo;audit de code qui consiste &agrave; lire le code source d&rsquo;une application web pour rechercher les failles.</p><h4>2.R&eacute;action</h4><p style="text-align: justify;">En cas d&rsquo;attaque, l&rsquo;organisme touch&eacute; doit &ecirc;tre capable de r&eacute;agir rapidement et en cons&eacute;quence. La note technique de l&rsquo;ANSSI couvre ce point. Elle conseille d&rsquo;avoir un point de contact associ&eacute; au site facilement identifiable pour &ecirc;tre pr&eacute;venu rapidement en cas d&rsquo;attaque.</p><p style="text-align: justify;">De plus, pour r&eacute;agir rapidement, l&rsquo;attaque doit &ecirc;tre d&eacute;tect&eacute;e rapidement. L&rsquo;ANSSI conseille de faire un travail de journalisation en sauvegardant par exemple le dernier &eacute;chec de connexion des utilisateurs. La surveillance est &eacute;galement primordiale dans la s&eacute;curit&eacute; web, parcourir son site &agrave; la recherche d&rsquo;anomalie permet de d&eacute;tecter des attaques.</p><p style="text-align: justify;">En cas d&rsquo;incident, il est primordial de regrouper toutes les informations possibles pour permettre d&rsquo;investiguer. Il est &eacute;galement indispensable de corriger les vuln&eacute;rabilit&eacute;s du site avant de le remettre en service.</p>