<h4>Les failles les plus courantes</h4><p style="text-align: justify;">L&rsquo;OWASP recense tous les trois ans les dix failles web les plus courantes. Pour d&eacute;terminer ce classement, l&rsquo;OWASP se base sur trois crit&egrave;res : difficult&eacute; &agrave; trouver la faille, difficult&eacute; pour l&rsquo;exploiter et le pr&eacute;judice que l&rsquo;attaque peut causer. Le top 10 de 2017 est disponible en suivant ce lien. Un r&eacute;sum&eacute; se trouve ci-dessous.</p><h4>1.Injection</h4><p style="text-align: justify;">Les failles d&rsquo;injection, telles que SQL, noSQL, OS, LDAP sont courantes dans les applications web. L&rsquo;injection consiste &agrave; fournir une donn&eacute;e malicieuse &agrave; un interpr&eacute;teur dans le cadre d&rsquo;une commande ou requ&ecirc;te. La requ&ecirc;te peut alors duper l&rsquo;interpr&eacute;teur et permet &agrave; l&rsquo;attaquant d&rsquo;acc&eacute;der, de modifier ou de supprimer des donn&eacute;es normalement prot&eacute;g&eacute;es.</p><h4>2.Violation de gestion d&rsquo;authentification et de session</h4><p style="text-align: justify;">Les droits d&#39;acc&egrave;s aux comptes et les jetons de session sont souvent incorrectement prot&eacute;g&eacute;s. Les attaquants compromettent les mots de passe, les clefs, ou les jetons d&#39;authentification pour s&#39;approprier les identit&eacute;s d&#39;autres utilisateurs.</p><h4>3.Protection insuffisante des donn&eacute;es sensibles</h4><p style="text-align: justify;">Beaucoup d&rsquo;applications web et d&rsquo;API ne prot&egrave;gent pas correctement leurs donn&eacute;es sensibles. Des attaquants peuvent alors voler ou modifier ces donn&eacute;es pour par exemple commettre des fraudes sur les cartes de cr&eacute;dit. Des protections suppl&eacute;mentaires telles que l&rsquo;encodage sont donc n&eacute;cessaires.</p><h4>4.XML eXternal Entities : XXE</h4><p style="text-align: justify;">Un document XML se base sur une grammaire pour v&eacute;rifier sa conformit&eacute;. Cette grammaire est contenue dans un fichier appel&eacute; DTD (Document Type Definition). Des entit&eacute;s qui font r&eacute;f&eacute;rences &agrave; des ressources externes peuvent &ecirc;tre d&eacute;clar&eacute;es dans le DTD pour d&eacute;finir des variables. Ainsi en d&eacute;clarant des entit&eacute;s bien choisies dans le DTD, l&rsquo;attaquant peut acc&eacute;der &agrave; des fichiers prot&eacute;g&eacute;s.</p><h4>5.Violation de contr&ocirc;le d&rsquo;acc&egrave;s</h4><p style="text-align: justify;">Les restrictions sur ce que les utilisateurs authentifi&eacute;s ont le droit de faire ou non ne sont g&eacute;n&eacute;ralement pas mises en &oelig;uvre correctement. Les attaquants peuvent exploiter ces failles pour acc&eacute;der &agrave; du contenu non autoris&eacute;.</p><h4>6.Mauvaise configuration s&eacute;curit&eacute;</h4><p style="text-align: justify;">Une mauvaise configuration de s&eacute;curit&eacute; est l&rsquo;erreur la plus courante. La configuration concerne l&rsquo;ensemble suivant : l&rsquo;application, le contexte, le serveur d&rsquo;application, le serveur web, le serveur de donn&eacute;es et la plate-forme. Cet ensemble doit &ecirc;tre correctement configur&eacute; et mis &agrave; jour r&eacute;guli&egrave;rement.</p><h4>7.Cross Site Scripting : XSS</h4><p style="text-align: justify;">L&rsquo;injection de donn&eacute;es arbitraires dans un site web peut r&eacute;v&eacute;ler des failles si les donn&eacute;es transmises ne sont pas v&eacute;rifi&eacute;es. Ces failles permettent d&rsquo;ex&eacute;cuter des scripts dans le navigateur de la victime pour voler des sessions utilisateurs par exemple.</p><h4>8.D&eacute;s&eacute;rialisation non s&eacute;curis&eacute;e</h4><p style="text-align: justify;">La s&eacute;rialisation consiste &agrave; convertir un objet dans un format qui est facilement stockable. La d&eacute;s&eacute;rialisation est le processus inverse et permet de r&eacute;cup&eacute;rer l&rsquo;objet. On parle de d&eacute;s&eacute;rialisation non s&eacute;curis&eacute;e si les donn&eacute;es &agrave; d&eacute;s&eacute;rialiser peuvent &eacute;t&eacute; modifi&eacute;es par un utilisateur sans v&eacute;rification. La d&eacute;s&eacute;rialisation non s&eacute;curis&eacute;e entra&icirc;ne souvent l&rsquo;ex&eacute;cution de code &agrave; distance. Elles peuvent aussi &ecirc;tre utilis&eacute;es pour d&rsquo;autres types d&rsquo;attaques tels que les attaques par injection ou par rejeu.</p><h4>9.Utilisation de composants avec des vuln&eacute;rabilit&eacute;s connues</h4><p style="text-align: justify;">Les composants tels que les librairies, les frameworks et les autres modules logiciels ont les m&ecirc;mes privil&egrave;ges que l&rsquo;application. Si un de ces composants pr&eacute;sente une vuln&eacute;rabilit&eacute;, l&rsquo;application est aussi compromise. L&rsquo;utilisation de composants qui pr&eacute;sentent des vuln&eacute;rabilit&eacute;s connues peut alors donner lieu &agrave; des attaques sur l&rsquo;application.</p><h4>10.Insuffisance d&rsquo;authentification et de contr&ocirc;le</h4><p style="text-align: justify;">L&rsquo;insuffisance d&rsquo;authentification et de contr&ocirc;le coupl&eacute;e &agrave; une mauvaise gestion des r&eacute;ponses suite &agrave; un incident est un terrain de jeu parfait pour les attaquants. Ils peuvent mener des attaques en toute discr&eacute;tion.</p><p><br></p><p><br></p><h4>R&eacute;f&eacute;rences :</h4><p>Recommandation pour la s&eacute;curisation des sites web :</p><p><a href="https://www.ssi.gouv.fr/uploads/IMG/pdf/NP_Securite_Web_NoteTech.pdf">https://www.ssi.gouv.fr/uploads/IMG/pdf/NP_Securite_Web_NoteTech.pdf<br><br></a> Top 10 des vuln&eacute;rabilit&eacute;s web les plus courantes par l&rsquo;OWASP :</p><p><a href="https://www.owasp.org/images/7/72/OWASP_Top_10-2017_%28en%29.pdf.pdf">https://www.owasp.org/images/7/72/OWASP_Top_10-2017_%28en%29.pdf.pdf<br><br></a> Guide d&rsquo;&eacute;valuation des scanners web par le WASC :</p><p><a href="http://projects.webappsec.org/w/page/13246986/Web%20Application%20Security%20Scanner%20Evaluation%20Criteria">http://projects.webappsec.org/w/page/13246986/Web%20Application%20Security%20Scanner%20Evaluation%20Criteria</a></p><p><br></p><p>Autres r&eacute;f&eacute;rences :</p><p><a href="http://www.labo-g4.fr/v1//node/472">http://www.labo-g4.fr/v1//node/472</a></p><p><a href="http://www.w3b.fr/blog/evolution-d-internet-1990-2020.htm">http://www.w3b.fr/blog/evolution-d-internet-1990-2020.htm</a></p><p><a href="https://fr.wikipedia.org/wiki/S%C3%A9curit%C3%A9_internet">https://fr.wikipedia.org/wiki/S%C3%A9curit%C3%A9_internet</a></p><p><a href="https://fr.wikipedia.org/wiki/Audit_de_s%C3%A9curit%C3%A9">https://fr.wikipedia.org/wiki/Audit_de_s%C3%A9curit%C3%A9</a></p><p><a href="https://web.developpez.com/tutoriels/web/failles-securite-application-web/#LIV-A">https://web.developpez.com/tutoriels/web/failles-securite-application-web/#LIV-A</a></p><p><a href="https://www.owasp.org/images/0/08/OWASP_SCP_Quick_Reference_Guide_v2.pdf">https://www.owasp.org/images/0/08/OWASP_SCP_Quick_Reference_Guide_v2.pdf</a></p><p><a href="https://www.owasp.org/index.php/Category:Vulnerability_Scanning_Tools">https://www.owasp.org/index.php/Category:Vulnerability_Scanning_Tools</a></p><p><a href="https://developer.mozilla.org/fr/docs/Learn/Server-side/First_steps/Website_security">https://developer.mozilla.org/fr/docs/Learn/Server-side/First_steps/Website_security</a></p><p><a href="http://prox-ia.blogspot.fr/2014/12/une-faille-xxl-lattaque-xxe.html">http://prox-ia.blogspot.fr/2014/12/une-faille-xxl-lattaque-xxe.html</a></p><p><a href="https://fr.wikipedia.org/wiki/Cross-site_scripting">https://fr.wikipedia.org/wiki/Cross-site_scripting</a></p><p><a href="https://www.acunetix.com/blog/articles/what-is-insecure-deserialization">https://www.acunetix.com/blog/articles/what-is-insecure-deserialization</a></p><p><a href="http://www.zebulon.fr/actualites/15842-piratage-les-informations-de-34500-clients-d-acer-dans-la-nature.html">http://www.zebulon.fr/actualites/15842-piratage-les-informations-de-34500-clients-d-acer-dans-la-nature.html</a></p><p><a href="http://www.lindependant.fr/2017/10/21/anonymous-attaque-le-site-web-du-tribunal-constitutionnel-espagnol,3062439.php">http://www.lindependant.fr/2017/10/21/anonymous-attaque-le-site-web-du-tribunal-constitutionnel-espagnol,3062439.php</a></p><p><a href="https://www.usine-digitale.fr/article/les-quatre-acteurs-francais-incontournables-dans-la-cybersecurite.N308486">https://www.usine-digitale.fr/article/les-quatre-acteurs-francais-incontournables-dans-la-cybersecurite.N308486</a></p><p><a href="https://www.cert.ssi.gouv.fr/information/CERTA-2012-INF-002/">https://www.cert.ssi.gouv.fr/information/CERTA-2012-INF-002/</a></p><p><a href="https://www.preferendum.fr/blog/web-1.0-2.0-3.0-l%C3%A9volution-dinternet-et-son-impact-sur-le-marketing-digital">https://www.preferendum.fr/blog/web-1.0-2.0-3.0-l%C3%A9volution-dinternet-et-son-impact-sur-le-marketing-digital</a></p><p><br></p><p>Annexe</p><p><br></p><p align="center"><img src="/images/introduction2.png" alt="coucou" style="width: 90%;" class="fr-fic fr-dii"><br><br>Figure 2 : Grille d&rsquo;&eacute;valuation r&eacute;alis&eacute;e par le WASC pour les scanners de vuln&eacute;rabilit&eacute; de sites web</p>