<h4>Injection SQL</h4><p style="text-align: justify;">Parmi les failles web, l&rsquo;injection SQL est s&ucirc;rement la plus connue. C&rsquo;est aussi pour &ccedil;a qu&rsquo;il existe des m&eacute;thodes simples pour s&rsquo;en pr&eacute;munir.</p><p style="text-align: justify;">Rappelons bri&egrave;vement ce qu&rsquo;est une injection SQL&nbsp;:</p><p style="text-align: justify;">L&rsquo;attaque consiste &agrave; modifier une requ&ecirc;te SQL en injectant des morceaux de code non filtr&eacute;s, g&eacute;n&eacute;ralement par le biais d&#39;un formulaire. Imaginons la requ&ecirc;te SQL suivante encapsul&eacute;e dans du PHP pour authentifier un membre&nbsp;sur un site web&nbsp;:</p><p><code>$req = $bdd-&gt;query(&quot;SELECT * FROM utilisateurs WHERE login=&#39;$login&#39; AND password=&#39;$password&#39;&quot;);</code></p><p style="text-align: justify;">Les variables $login et $password proviennent directement du formulaire de connexion. Si un utilisateur s&rsquo;amuse &agrave; remplir le champ login par &laquo;&nbsp;jean&rsquo; #&nbsp;&raquo; et &agrave; laisser le champ de mot de passe vide, la requ&ecirc;te cherchera un compte qui a pour login jean.</p><p><code>&lt;?php $req = $bdd-&gt;query(&quot;SELECT * FROM utilisateurs WHERE login=&#39;jean&#39; # AND password=&#39;&#39;&quot;); // Qui sera interpr&eacute;t&eacute; de la fa&ccedil;on suivante $req = $bdd-&gt;query(&quot;SELECT * FROM utilisateurs WHERE login=&#39;jean&#39;&quot;); ?&gt;</code></p><p style="text-align: justify;">Il sera donc tr&egrave;s simple pour un utilisateur malveillant de s&rsquo;authentifier avec n&rsquo;importe quel compte&nbsp;! Voici d&rsquo;autres utilisations d&rsquo;injection SQL pour d&eacute;tourner la requ&ecirc;te initiale&nbsp;:</p><ul><li>Les conditions toujours vraies comme 1 = 1</li><li><code>SELECT * FROM admin WHERE login=&#39;&#39; OR &#39;1&#39;=&#39;1&#39; AND pass=&#39;&#39; OR &#39;1&#39;=&#39;1&#39;</code></li><li>Les liaisons entre les tables</li><li><code>SELECT login, password FROM admin WHERE login=&#39;&#39; UNION SELECT login, password from admin # &#39; and password=&#39;$password&#39;&nbsp;</code></li><li>Outfile</li><li><code>SELECT login, password FROM admin WHERE login=&#39;&#39; OR &#39;X&#39;=&#39;X&#39; INTO OUTFILE &#39;../../www/file.txt&#39; #&#39; AND password=&#39;$password&#39;&quot;;&nbsp;</code></li></ul><p style="text-align: justify;">Les variables qui interviennent dans les requ&ecirc;tes SQL ne proviennent pas n&eacute;cessairement de formulaire. Elles peuvent provenir de l&rsquo;URL. Ainsi toutes les variables qui interviennent dans les requ&ecirc;tes SQL et qui peuvent &ecirc;tre modifi&eacute;es par l&rsquo;utilisateur doivent &ecirc;tre v&eacute;rifi&eacute;es. Et pour cela il existe un moyen tr&egrave;s simple&nbsp;: les requ&ecirc;tes pr&eacute;par&eacute;es.</p><p style="text-align: justify;">Les langages web qui sont mis &agrave; jour proposent les requ&ecirc;tes pr&eacute;par&eacute;es. En PHP, la requ&ecirc;te pr&eacute;c&eacute;dente s&rsquo;&eacute;crira&nbsp;comme suit sous forme de requ&ecirc;te pr&eacute;par&eacute;e :</p><p><code>&nbsp;// Requ&ecirc;te SQL s&eacute;curis&eacute;e $req = $bdd-&gt;prepare(&quot;SELECT * FROM utilisateurs WHERE login= ? AND password= ?&quot;); $req-&gt;execute(array($login, $password));&nbsp;</code></p><p style="text-align: justify;">Mais pourquoi les requ&ecirc;tes pr&eacute;par&eacute;es emp&ecirc;chent-elles&nbsp;l&rsquo;ex&eacute;cution de code malicieux&nbsp;?</p><p style="text-align: justify;">Une requ&ecirc;te SQL peut &ecirc;tre vue comme un programme et comme le montre la requ&ecirc;te pr&eacute;par&eacute;e pr&eacute;c&eacute;dente, la requ&ecirc;te qui constitue le programme n&rsquo;a aucune valeur de variables. La premi&egrave;re requ&ecirc;te permet &agrave; l&rsquo;interpr&eacute;teur SQL de prendre connaissance du programme.</p><p style="text-align: justify;">La deuxi&egrave;me requ&ecirc;te vient ensuite fournir les valeurs des variables mais elles restent s&eacute;par&eacute;es du programme SQL&nbsp;! L&rsquo;interpr&eacute;teur sait donc ce qu&rsquo;il doit ex&eacute;cuter et le code malicieux ne sera pas ex&eacute;cut&eacute;.</p><p style="text-align: justify;">Il est pr&eacute;f&eacute;rable de ne pas utiliser les fonctions de type mysql_real_escape_string() qui &eacute;chappent les caract&egrave;res sp&eacute;ciaux SQL en ajoutant un \ aux cha&icirc;nes suivantes&nbsp;: NULL,&nbsp;\x00,&nbsp;\n,&nbsp;\r,&nbsp;\,&nbsp;&#39;,&nbsp;&quot;&nbsp;et&nbsp;\x1a.</p><p style="text-align: justify;">En effet, ces fonctions ne permettent pas de se prot&eacute;ger de toutes les injections SQL et notamment des injections sur des variables de type num&eacute;rique. Analysons l&rsquo;exemple suivant&nbsp;:</p><p><code>&nbsp;$id = $_POST[&#39;id&#39;]; $requete = mysql_query(&quot;SELECT age FROM membres WHERE id=$id&quot;);&nbsp;</code></p><p style="text-align: justify;">mysql_real_escape_string()&nbsp;ne servirait &agrave; rien ici.</p><p style="text-align: justify;">En effet si un pirate veut injecter du code SQL, il n&#39;aura pas besoin d&#39;utiliser les&nbsp;quotes puisque la variable&nbsp;$id&nbsp;n&#39;est pas entour&eacute;e de&nbsp;quotes. Voici un exemple simple d&#39;exploitation :</p><p><code>&nbsp;2 UNION&nbsp;SELECT&nbsp;password&nbsp;FROM&nbsp;membres&nbsp;WHERE&nbsp;id=1&nbsp;</code></p><p style="text-align: justify;">Qui sera interpr&eacute;t&eacute; de la mani&egrave;re suivante :</p><p><code>&nbsp;SELECT age FROM membres WHERE id=2 UNION&nbsp;SELECT&nbsp;password&nbsp;FROM&nbsp;membres&nbsp;WHERE&nbsp;id=1&nbsp;</code></p><p style="text-align: justify;">C&rsquo;est pourquoi il est necessaire d&rsquo;utiliser des requ&ecirc;tes pr&eacute;par&eacute;es.</p><p style="text-align: justify;"><br></p><p style="text-align: justify;">R&eacute;f&eacute;rences :</p><p style="text-align: justify;"><a href="https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2680180-linjection-sql">https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2680180-linjection-sql</a></p><p style="text-align: justify;"><a href="https://openclassrooms.com/fr/courses/439046-eviter-les-injections-sql">https://openclassrooms.com/fr/courses/439046-eviter-les-injections-sql</a></p>