<h4>La CRLF</h4><h5>Explication</h5><p style="text-align: justify;">La faille CRLF (Carriage Return Line Feed) permet - comme son nom l&#39;indique - d&#39;effectuer un retour chariot dans un champ du type input ou textarea. Elle est le plus souvent utilis&eacute;e pour r&eacute;cup&eacute;rer le mot de passe de quelqu&#39;un, gr&acirc;ce &agrave; la fonction mail() de la page &quot;mot de passe oubli&eacute;&quot; pr&eacute;sent sur un tr&egrave;s grand nombre de sites. Il nous suffit de connaitre l&#39;adresse mail de la victime et d&#39;utiliser la faille pour nous mettre en copie de ce mail. Prenons un cas concret. Ce formulaire est pr&eacute;sent sur la page &quot;mot de passe oubli&eacute;&quot; :</p><p><code>&nbsp;&lt;form action=&quot;password_oublie.php&quot; method=&quot;POST&quot;&gt;<br>&nbsp;&lt;input type=&quot;text&quot; name=&quot;mail&quot;&gt;<br>&nbsp;&lt;input type=&quot;submit&quot; value=&quot;Envoyer&quot;&gt;<br>&nbsp;&lt;/form&gt;<br></code></p><p style="text-align: justify;">Le hacker va alors essayer de se mettre en copie du mail. Pour cela il lui suffit d&#39;ins&eacute;rer un retour &agrave; la ligne dans le champ input en utilisant la chaine &quot;%0A&quot;. On obtient quelque chose comme &ccedil;a :</p><p><code>&nbsp;victime@service.com%0Apirate@service.com&nbsp;</code></p><p><br></p><h5>Comment s&#39;en prot&eacute;ger ?</h5><p style="text-align: justify;">Pas de grande surprise pour cette partie, le moyen le plus efficace pour s&#39;en prot&eacute;ger est tout simplement de supprimer les retours &agrave; la ligne lors du traitement.</p><p><code>&nbsp;&lt;?php<br>&nbsp;// On r&eacute;cup&egrave;re la valeur du input<br>&nbsp;$chaine_utilisateur = $_POST[&#39;mail&#39;];<br>&nbsp;// On supprime les retour &agrave; la ligne<br>&nbsp;$chaine_secure = str_replace(array(&quot;\n&quot;,&quot;\r&quot;,PHP_EOL),&#39;&#39;,$chaine_utilisateur);<br>&nbsp;?&gt;&nbsp;</code></p><p><br></p><p style="text-align: justify;">Vous pouvez &eacute;galement v&eacute;rifier que la chaine de caract&egrave;res entr&eacute;e par l&#39;utilisateur est bien une adresse mail. Utilisez par exemple un filtre :</p><p><code>&nbsp;&lt;?php<br>&nbsp;$email = $_POST[&#39;mail&#39;];<br>&nbsp;if(filter_var($email, FILTER_VALIDATE_EMAIL)){<br></code></p><p class="tabulation"><code>// Valide</code></p><code>&nbsp;}<br>&nbsp;else {<br><p class="tabulation">// Non valide</p>&nbsp;}<br>&nbsp;?&gt;&nbsp;</code><p></p><p>Il est &eacute;galement possible de v&eacute;rifier la forme de l&#39;adresse gr&acirc;ce &agrave; une expression r&eacute;guli&egrave;re. Voil&agrave; ce type de v&eacute;rification para&icirc;t anodin, mais vous &eacute;vitera beaucoup de probl&egrave;mes par la suite.</p><p><br></p><p>R&eacute;f&eacute;rences :</p><p><a href="https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2863578-la-crlf">https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2863578-la-crlf</a></p>