<h4>La faille XXE (XML eXternal Entities)</h4><p style="text-align: justify;">Pour bien comprendre le fonctionnement et l&rsquo;exploitation de cette faille, il convient de revenir sur la notion de document XML et du fichier DTD (Document Type Definition).</p><p style="text-align: justify;">Le langage XML (eXtensible Markup Language) est un langage qui permet de d&eacute;crire des donn&eacute;es &agrave; l&#39;aide de balises et de r&egrave;gles que l&#39;on peut personnaliser. Par exemple, ces r&egrave;gles peuvent imposer la pr&eacute;sence d&#39;un attribut ou d&#39;une balise, imposer l&#39;ordre d&#39;apparition des balises dans le document ou encore imposer le type d&#39;une donn&eacute;e.</p><p><code>&nbsp;&lt;?xml version = &quot;1.0&quot; encoding=&quot;UTF-8&quot; standalone=&quot;yes&quot; ?&gt;<br>&nbsp;&lt;repertoire&gt;<br></code></p><p class="tabulation"><code>&lt;personne&gt;Bernard&lt;/personne&gt;</code></p><code>&nbsp;<p class="tabulation">&lt;personne&gt;Patrick&lt;/personne&gt;</p>&nbsp;&lt;/repertoire&gt;<br></code><p></p><p style="text-align: justify;">Une Document Type Definition ou en fran&ccedil;ais une D&eacute;finition de Type de Document, souvent abr&eacute;g&eacute; DTD, est une technologie pour &eacute;crire les d&eacute;finitions de nos documents XML.</p><p style="text-align: justify;">Tout comme les fichiers XML, les DTD s&#39;&eacute;crivent dans des fichiers. Il existe 2 types de DTD : les DTD externes et les DTD internes.</p><p style="text-align: justify;">Les r&egrave;gles des DTD internes s&#39;&eacute;crivent directement dans le fichier XML qu&#39;elles d&eacute;finissent tandis que les r&egrave;gles des DTD externes sont &eacute;crites dans un fichier s&eacute;par&eacute; portant l&rsquo;extension .dtd.</p><p style="text-align: justify;">Maintenant que vous en savez un peu plus, je vous propose de rentrer dans le vif du sujet. Des entit&eacute;s peuvent &ecirc;tre d&eacute;clar&eacute;es dans le DTD pour d&eacute;finir des variables. Elles peuvent &ecirc;tre internes pour d&eacute;finir des r&egrave;gles de substitution d&rsquo;un &eacute;l&eacute;ment par un autre dans le document XML. Ces entit&eacute;s peuvent aussi &ecirc;tre externes et dans ce cas faire r&eacute;f&eacute;rence &agrave; des ressources qui peuvent &ecirc;tre le syst&egrave;me de fichier local ou un ordinateur distant.</p><p style="text-align: justify;">Si le parser XML est vuln&eacute;rable, en d&eacute;finissant les bonnes entit&eacute;s on peut acc&eacute;der &agrave; des ressources prot&eacute;g&eacute;es. Par exemple, en modifiant le fichier XML de cette mani&egrave;re, on peut acc&eacute;der au fichier d&rsquo;identification du syst&egrave;me&nbsp;/etc/passwd.</p><p><code>&nbsp;&lt;?xml version=&#39;1.0&#39; encoding=&quot;UTF-8&quot;?&gt;<br>&nbsp;&lt;!DOCTYPE x [<br>&nbsp;&lt;!ENTITY passwd SYSTEM &#39;file:/etc/passwd&#39;&gt;<br>&nbsp;]&gt;<br>&nbsp;&lt;repertoire&gt;<br></code></p><p class="tabulation"><code>&lt;personne&gt;&amp;passwd&nbsp;;&lt;/personne&gt;</code></p><code>&nbsp;<p class="tabulation">&lt;personne&gt;Patrick&lt;/personne&gt;</p>&nbsp;&lt;/repertoire&gt;<br></code><p></p><h5>Comment s&rsquo;en pr&eacute;munir&nbsp;?</h5><p style="text-align: justify;">L&rsquo;utilisation d&rsquo;entit&eacute; externe n&rsquo;est &agrave; activer qu&rsquo;en cas de r&eacute;elle n&eacute;cessit&eacute; au niveau de l&rsquo;analyseur syntaxique, et leur valeur doit &ecirc;tre v&eacute;rifi&eacute;e.</p><h5>R&eacute;f&eacute;rences :</h5><p><a href="https://www.synetis.com/2014/02/13/les-attaques-xxe-des-protocoles-dauthentification-oauth-openid/">https://www.synetis.com/2014/02/13/les-attaques-xxe-des-protocoles-dauthentification-oauth-openid/</a><a href="https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml">https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml</a><a href="https://www.synetis.com/2014/02/13/les-attaques-xxe-des-protocoles-dauthentification-oauth-openid/">https://www.synetis.com/2014/02/13/les-attaques-xxe-des-protocoles-dauthentification-oauth-openid/</a></p>