<h4>La faille upload</h4><p style="text-align: justify;">Explication</p><p style="text-align: justify;">La faille upload est une des failles les plus dangereuses. Vous connaissez&nbsp;s&ucirc;rement la balise HTML qui permet l&#39;upload de fichier :</p><p><code>&nbsp;&lt;input type=&quot;file&quot; /&gt;&nbsp;</code></p><p><br></p><p style="text-align: justify;">Cette balise est utilis&eacute;e sur de nombreux sites qui proposent &agrave; leurs utilisateurs d&#39;avoir une photo de profil ou d&#39;inclure une image dans un message sur le forum. Le probl&egrave;me, c&#39;est que la balise upload permet d&#39;uploader n&#39;importe quel fichier.</p><p style="text-align: justify;">Un utilisateur malintentionn&eacute; pourrait sans probl&egrave;me s&#39;amuser &agrave; uploader un fichier PHP malveillant (web shell par exemple) qui lui permettrait&nbsp;de&nbsp;prendre le&nbsp;contr&ocirc;le total de votre site, et m&ecirc;me par rebond, de prendre la main sur le serveur en backoffice ! Et m&ecirc;me si vous avez fait les quelques v&eacute;rifications r&eacute;glementaires, il est possible qu&#39;il y ait malgr&eacute; tout des faiblesses exploitables.</p><h5>La double extension</h5><p style="text-align: justify;">Vous avez peut-&ecirc;tre pens&eacute; &agrave; limiter l&#39;upload &agrave; certains types de fichier et c&#39;est tout &agrave; votre honneur. Imaginons un site qui autorise uniquement les fichiers .jpg. Qu&#39;est-ce qui m&#39;emp&ecirc;che de renommer mon fichier en &quot;backdoor.php.jpg&quot; et de l&#39;envoyer ? Et bien c&#39;est l&agrave; tout le probl&egrave;me : rien !</p><p style="text-align: justify;">Il est &eacute;galement possible de renommer son fichier en tant que &quot;backdoor.php\0.jpg&quot;. Le &quot;\0&quot; indique au serveur qu&#39;il arrive en bout de chaine. Tout ce qui suit ne sera donc pas interpr&eacute;t&eacute;. Le fichier sera enregistr&eacute; en tant que &quot;backdoor.php&quot; et aura pass&eacute; haut la main le test d&#39;extension.</p><h5>Le content-type</h5><p style="text-align: justify;">Cette technique consiste &agrave; utiliser une extension sur le navigateur pour alt&eacute;rer les donn&eacute;es envoy&eacute;es au serveur. Il sera alors enfantin de faire croire au serveur que notre fichier est un fichier image et non un fichier PHP.</p><h5>Comment s&#39;en prot&eacute;ger</h5><p style="text-align: justify;">Bon tout d&#39;abord, sachez qu&#39;il est tr&egrave;s difficile de cr&eacute;er un filtre&nbsp;compl&egrave;tement fiable. Voici les 8 r&egrave;gles basiques pour impl&eacute;menter un syst&egrave;me d&#39;upload s&eacute;curis&eacute; :</p><ul><li>1. Renommez le fichier</li><li>2. N&#39;enregistrez pas vos fichiers &agrave; la racine de votre site</li><li>3. V&eacute;rifiez la taille du fichier</li><li>4. Ne vous fiez pas aux extensions</li><li>5. Effectuez un scan anti-malware</li><li>6. Gardez le contr&ocirc;le des permissions (CHMOD)</li><li>7. N&rsquo;autorisez l&#39;upload qu&#39;aux utilisateurs inscrits et authentifi&eacute;s</li><li>8. Limitez le nombre de fichiers qu&#39;un utilisateurs peut mettre en ligne</li></ul><p style="text-align: justify;">Attaquons nous donc &agrave; ce script ! Tout d&#39;abord, il nous faut renommer le fichier en question. Un hash g&eacute;n&eacute;r&eacute; (pseudo) al&eacute;atoirement fera particuli&egrave;rement bien l&#39;affaire :</p><p><code>&nbsp;&lt;?php<br>&nbsp;$file = $_FILES[&quot;MY_FILE&quot;];<br>&nbsp;$actualName = $file[&#39;tmp_name&#39;];<br>&nbsp;$newName = bin2hex(mcrypt_create_iv(32, MCRYPT_DEV_URANDOM));<br>&nbsp;?&gt;&nbsp;</code></p><p><br></p><p style="text-align: justify;">Il nous faut maintenant choisir un r&eacute;pertoire d&#39;upload coh&eacute;rent avec notre situation. Ce sera donc &agrave; vous de d&eacute;terminer o&ugrave; vous souhaitez que les fichiers atterrissent. Il faudra penser &agrave; bien d&eacute;finir les droits lecture/&eacute;criture, ainsi que mettre en place un solide htaccess qui interdirait de voir l&rsquo;index of&nbsp;du r&eacute;pertoire en question. Dans mon cas, je me contenterais d&#39;un r&eacute;pertoire &quot;upload&quot; qui convient parfaitement &agrave; un cas g&eacute;n&eacute;ral.</p><p><code>&nbsp;&lt;?php<br>&nbsp;$file = $_FILES[&quot;MY_FILE&quot;];<br>&nbsp;$actualName = $file[&#39;tmp_name&#39;];<br>&nbsp;$newName = bin2hex(mcrypt_create_iv(32, MCRYPT_DEV_URANDOM));<br>&nbsp;$path = &quot;/upload&quot;<br>&nbsp;?&gt;&nbsp;</code></p><p style="text-align: justify;">On va ensuite v&eacute;rifier l&#39;extension propos&eacute;e, et voir si elle nous convient. Si tout va bien, il nous suiffera de la rajouter apr&egrave;s notre nouveau nom de fichier.</p><p><code>&nbsp;&lt;?php<br>&nbsp;$file = $_FILES[&quot;MY_FILE&quot;];<br>&nbsp;$actualName = $file[&#39;tmp_name&#39;];<br>&nbsp;$newName = bin2hex(mcrypt_create_iv(32, MCRYPT_DEV_URANDOM));<br>&nbsp;$path = &quot;/upload&quot;<br>&nbsp;// On cr&eacute;e un tableau avec les extensions autoris&eacute;es<br>&nbsp;$legalExtensions = array(&quot;JPG&quot;, &quot;PNG&quot;, &quot;GIF&quot;, &quot;TXT&quot;);<br>&nbsp;// On r&eacute;cup&egrave;re l&#39;extension du fichier soumis et on v&eacute;rifie qu&#39;elle soit dans notre tableau<br>&nbsp;$extension = pathinfo($file[&#39;MY_FILE&#39;], PATHINFO_EXTENSION);<br>&nbsp;if (in_array($extension, $legalExtensions)) {<br></code></p><p class="tabulation"><code>move_uploaded_file($actualName, $path.&#39;/&#39;.$newName.&#39;.&#39;.$extension);</code></p><code>&nbsp;} ?&gt;&nbsp;</code><p></p><p><br></p><p style="text-align: justify;">On a d&eacute;j&agrave; un bon d&eacute;but ! On va ajouter quelques v&eacute;rifications d&#39;usage pour mettre un peu tout &ccedil;a en forme :</p><p><code>&nbsp;&lt;?php<br>&nbsp;$error = false;<br><br>&nbsp;// On d&eacute;finit nos constantes<br>&nbsp;$newName = bin2hex(mcrypt_create_iv(32, MCRYPT_DEV_URANDOM));<br>&nbsp;$path = &quot;/upload&quot;<br>&nbsp;$legalExtensions = array(&quot;JPG&quot;, &quot;PNG&quot;, &quot;GIF&quot;, &quot;TXT&quot;);<br>&nbsp;$legalSize = &quot;10000000&quot; // 10000000 Octets = 10 MO<br><br>&nbsp;// On r&eacute;cup&egrave;re les infos<br>&nbsp;$file = $_FILES[&quot;MY_FILE&quot;];<br>&nbsp;$actualName = $file[&#39;tmp_name&#39;];<br>&nbsp;$actualSize = $file[&#39;size&#39;];<br>&nbsp;$extension = pathinfo($file[&#39;MY_FILE&#39;], PATHINFO_EXTENSION);<br><br>&nbsp;// On s&#39;assure que le fichier n&#39;est pas vide<br>&nbsp;if ($actualName == 0 || $actualSize == 0) {<br></code></p><p class="tabulation"><code>$error = true;</code></p><code>&nbsp;}<br><br>&nbsp;// On v&eacute;rifie qu&#39;un fichier portant le m&ecirc;me nom n&#39;est pas pr&eacute;sent sur le serveur<br>&nbsp;if (file_exists($path.&#39;/&#39;.$newName.&#39;.&#39;.$extension)) {<br><p class="tabulation">$error = true;</p>&nbsp;}<br><br>&nbsp;// On effectue nos v&eacute;rifications r&eacute;glementaires<br>&nbsp;if (!$error) {<br><p class="tabulation">if ($actualSize &lt; $legalSize) {</p>&nbsp;<p class="tabulation2">if (in_array($extension, $legalExtensions)) {</p>&nbsp;<p class="tabulation3">move_uploaded_file($actualName, $path.&#39;/&#39;.$newName.&#39;.&#39;.$extension);</p>&nbsp;<p class="tabulation2">}</p>&nbsp;<p class="tabulation">}</p>&nbsp;}<br>&nbsp;else {<br><p class="tabulation">// On supprime le fichier du serveur</p>&nbsp;<p class="tabulation">@unlink($path.&#39;/&#39;.$newName.&#39;.&#39;.$extension);</p>&nbsp;<p class="tabulation">echo &quot;Une erreur s&#39;est produite&quot;;</p>&nbsp;}<br>&nbsp;?&gt;&nbsp;</code><p></p><p><br></p><p style="text-align: justify;">Voil&agrave; &ccedil;a me semble plut&ocirc;t bien tout &ccedil;a. L&#39;id&eacute;al serait de coupler tout &ccedil;a &agrave; un solide htaccess. On pourrait imaginer quelque chose comme ceci :</p><p><code>&nbsp;deny from all<br>&nbsp;&lt;Files ~ &ldquo;^w+.(gif|jpg|png|txt)$&rdquo;&lt;<br></code></p><p class="tabulation"><code>order deny,allow</code></p><p><code>&nbsp;</code></p><p class="tabulation"><code>allow from all</code></p><code>&nbsp;&lt;/Files&gt;<br>&nbsp;Bas du formulaire&nbsp;</code><p></p><p><br></p><p><span style="font-family: Arial, Helvetica, sans-serif; color: rgb(0, 0, 0);">R&eacute;f&eacute;rences :</span></p><p><span style="font-family: Arial, Helvetica, sans-serif; color: rgb(0, 0, 0);"><a href="https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2680177-la-faille-upload">https://openclassrooms.com/fr/courses/2091901-protegez-vous-efficacement-contre-les-failles-web/2680177-la-faille-upload</a></span></p>